In [1]:
from sqlalchemy import create_engine

import pandas as pd

from datetime import datetime
from uuid import uuid4
    
# 'mysql+pymysql://mysql_user:mysql_password@mysql_host/mysql_db'
engine_str = 'mysql+pymysql://root:@localhost/test'
engine = create_engine(engine_str)

print(engine)

Engine(mysql+pymysql://root:***@localhost/test)

In [3]:
def load_data(engine):
    # get data
    df = pd.read_sql('SELECT * FROM tb_zoho', con=engine)
    
    return df

load_data(engine)

   id        created_date first_name last_name          email   phone  mobile
0   1 2022-12-10 14:09:35      Test1     Test2  test@test.com  123456  654321

In [64]:
# eventid = datetime.now().strftime('%Y%m-%d%H-%M%S-') + str(uuid4())
eventid = str(uuid4())
eventid

'c63537e5-34fe-4c6b-9735-fd59963eb149'

In [65]:
df_dict = {
    'created_date':['2022-12-08 14:09:35', '2022-12-10 11:09:35'], 
    'first_name':['Fajar', 'Toni'],
    'last_name':['Fatoni', 'Skyland'],
    'email':['fajarfatonisocial@gmail.com', 'toniskyland21@gmail.com'],
    'phone':['081237114791', '08132479912'],
    'mobile':['081237114798', '08132479912']
    }
new_df = pd.DataFrame.from_dict(df_dict)
new_df

new_df.to_sql(con=engine, name='tb_zoho', if_exists='append',index=False)

2

In [71]:
# insert data menggunakan query mysql

engine.execute("INSERT INTO tb_zoho (created_date, first_name, last_name, email, phone, mobile) VALUES ('2022-12-10 14:09:35', 'Test1', 'Test2', 'test@test.com', '123456', '654321')")
load_data(engine)

   id        created_date first_name last_name          email   phone  mobile
0   1 2022-12-10 14:09:35      Test1     Test2  test@test.com  123456  654321

In [67]:
# update data menggunakan query mysql

engine.execute("UPDATE tb_zoho SET first_name='Doe' WHERE id=2")
load_data(engine)

,id,created_date,first_name,last_name,email,phone,mobile
0,2,2022-12-10 14:09:35,Doe,Test2,test@test.com,123456,654321
1,3,2022-12-08 14:09:35,Fajar,Fatoni,fajarfatonisocial@gmail.com,081237114791,081237114798
2,4,2022-12-10 11:09:35,Toni,Skyland,toniskyland21@gmail.com,08132479912,08132479912

In [68]:
# delete data menggunakan query mysql

engine.execute("DELETE FROM tb_zoho")
# engine.execute("DELETE FROM tb_zoho WHERE id = 7")
load_data(engine)

Empty DataFrame
Columns: [id, created_date, first_name, last_name, email, phone, mobile]
Index: []

In [69]:
# reset auto increment row data

engine.execute("ALTER TABLE tb_zoho AUTO_INCREMENT = 1")
load_data(engine)

Empty DataFrame
Columns: [id, created_date, first_name, last_name, email, phone, mobile]
Index: []